БПКР/src/ChartsOfCalculationTypes/ВидыУдержаний/ВидыУдержаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ВидыУдержаний</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ВидыНачислений</baseCalculationTypes>
  <attributes>
    <name>СпособРасчета</name>
    <type>
      <types>EnumRef.СпособыРасчетаУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаРасчета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяРасчетБазы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяРасчетВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияРасчета</name>
    <type>
      <types>EnumRef.КатегорииРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасчетЗаМинусомПН</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетЗаМинусомСФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетЗаМинусомПрофВзнос</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
</mdclass:ChartOfCalculationTypes>

БПКР/src/Enums/СпособыРасчетаУдержаний/СпособыРасчетаУдержаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыРасчетаУдержаний</name>
  <enumValues>
    <name>Процентом</name>
  </enumValues>
  <enumValues>
    <name>ФиксированнойСуммой</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольнаяФормула</name>
  </enumValues>
</mdclass:Enum>

БПКР/src/Enums/КатегорииРасчетов/КатегорииРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорииРасчетов</name>
  <enumValues>
    <name>Первичное</name>
  </enumValues>
  <enumValues>
    <name>ЗависимоеПервогоУровня</name>
  </enumValues>
  <enumValues>
    <name>ЗависимоеВторогоУровня</name>
  </enumValues>
  <enumValues>
    <name>ЗависимоеТретьегоУровня</name>
  </enumValues>
  <enumValues>
    <name>ЗависимоеЧетвертогоУровня</name>
  </enumValues>
  <enumValues>
    <name>ЗависимоеПятогоУровня</name>
  </enumValues>
  <enumValues>
    <name>ЗависимоеШестогоУровня</name>
  </enumValues>
  <enumValues>
    <name>ЗависимоеСедьмогоУровня</name>
  </enumValues>
  <enumValues>
    <name>ЗависимоеВосьмогоУровня</name>
  </enumValues>
  <enumValues>
    <name>ЗависимоеДевятогоУровня</name>
  </enumValues>
  <enumValues>
    <name>ЗависимоеДесятогоУровня</name>
  </enumValues>
</mdclass:Enum>

БПКР/src/ChartsOfCalculationTypes/ВидыУдержаний/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	// Определение базовых и ведущих
	Если СпособРасчета = ПредопределенноеЗначение("Перечисление.СпособыРасчетаУдержаний.ФиксированнойСуммой") Тогда 
		БазовыеВидыРасчета.Очистить();
		ВедущиеВидыРасчета.Очистить();
		
		РасчетЗаМинусомПН = Ложь;
		РасчетЗаМинусомСФ = Ложь;
		РасчетЗаМинусомПрофВзнос = Ложь;
	КонецЕсли;
	
	// Определение ТребуетсяРасчетБазы 
	ТребуетсяРасчетБазы = НЕ БазовыеВидыРасчета.Количество() = 0;
	
	// Определение ТребуетсяРасчетВремени 
	ТребуетсяРасчетВремени = Ложь;
	
	// Определение для ПроизвольнаяФормула
	
	// Определение Категории
	КатегорияРасчета = ПредопределенноеЗначение("Перечисление.КатегорииРасчетов.Первичное");
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если СпособРасчета = ПредопределенноеЗначение("Перечисление.СпособыРасчетаУдержаний.Процентом") Тогда 
		ПроверяемыеРеквизиты.Добавить("БазовыеВидыРасчета");		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
